/*
* 时间：2021年6月10日18点22分
* 目的：学习数组
初始化
     完全初始化
             int [5] = {1,2,3,4,5};
     不完全初始化,未被初始化的元素自动为0
             int [5] = {1,2,3};
     不初始化,所有元素是垃圾值
             int a[5];
         清零
             int a[5] = {0};
###########错误写法############重点！！！！########
        int a[5];
        a[5] = {1,2,3,4,5};//错误
        只有在定义数组的同时才可以整体赋值，
        其他情况下整体赋值都是错误的。

        int a[5] = {1,2,3,4,5};
        a[5] = 100;  //错。没有a[5]这个元素，最大只有a[4]

         int a[5] = {1,2,3,4,5};
         int b[5];
         如果要把a数组的全部值复制给b数组
               错误写法：
                         b = a;
               正确写法;
                     for (i = 0; i<5; ++i)
                          b[i] = a[i];
*/

//二维数组的使用
#include <stdio.h>

int main()
{
    int a[3][4] =
    {
        {1,2,3,4},
        {5,6,7,8},
        {9,10,11,12}
    };
    int i, j;
    //输出数组内容
    for (i = 0; i < 3; ++i)
    {
        for (j = 0; j < 4; ++j)
            printf("%-5d  ",a[i][j]);             
        printf("\n");
    }
}
//vs2019输出