#include <stdio.h>


/*
int main(void)
{
	int a[5];     
	printf("%d\n", a[0]);
	//输出结果是垃圾值，说明未初始化的数组元素存放的是垃圾值
}
*/





/*    
int main(void)
{
	
	int b[5] = { 1,2,3 };
	printf("%d,%d\n", b[1], b[4]);
	//输出2，0    说明为赋值的元素初始化为0
	
  
	int c[5] = { 1,2,3,4,55 };
	//printf("%d\n", c);   //输出10484524 ，是数组c的地址
	//printf("%d\n", &c[0]); //输出10484524，是数组c第一个元素的地址
	//说明数组变量名是一个指针常量，它存放了第一哥元素的地址
	//可以说数组名和第一个元素是等价的，通过使用数组变量名访问到第一个元素
	printf("%d\n", *c);      //输出1，是第一个元素的值
	printf("%d\n", *(c + 4)); //输出55，是第五个元素的值。‘
	//数组名是指针常量，不是变量，数组名的值不可改变
	 
	if (c[2] == *(c + 2))
	{
		printf("正确\n");  //执行该语句
	}
	else
		printf("错误\n");
}
*/


int main(void)
{
	int a[5] = { 1,2,3,4,5 };
	printf("%d\n", &a[0]);         //6093460
	printf("%d\n", &a[1]);        // 6093464
	//a+1完成了地址向后移一个单元，int是4字节,所以是64而不是61   
	
	printf("%d\n", a);          //6093460
	printf("%d\n", a + 1);      //6093464
	printf("%d\n", a + 2);       //6093468
}



